---
type: CustomExporter
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# CustomExporter

`Autodesk.Revit.DB.CustomExporter` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | CustomExporter | 2014 | `public CustomExporter ( Document document , IExportContext context )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | Export | — | `` |
| Method | IsRenderingSupported | 2014 UR1 | `public static bool IsRenderingSupported ()` |
| Property | Export2DForceDisplayStyle | 2020 | `public DisplayStyle Export2DForceDisplayStyle { get ; set ; }` |
| Property | Export2DGeometricObjectsIncludingPatternLines | 2020 | `public bool Export2DGeometricObjectsIncludingPatternLines { get ; set ; }` |
| Property | Export2DIncludingAnnotationObjects | 2020 | `public bool Export2DIncludingAnnotationObjects { get ; set ; }` |
| Property | IncludeGeometricObjects | 2014 | `public bool IncludeGeometricObjects { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | ShouldStopOnError | 2014 | `public bool ShouldStopOnError { get ; set ; }` |